# Pandas - Parte 1 - BASE

In [1]:
import pandas as pd
import numpy as np

In [2]:
# Dict in Hand
d = {
    'a':10,
    'b':20,
    'c':30
}
d

{'a': 10, 'b': 20, 'c': 30}

In [3]:
# Dict with pandas
d_new = pd.Series(
    data = [10,20,30],
    index = ['a','b','c']
)
d_new

a    10
b    20
c    30
dtype: int64

## Operations with Series

In [4]:
a = pd.Series(
    index = ["Taubaté","Londres","Dublin"],
    data = [10,20,30]
)
b = pd.Series(
    index = ["Taubaté", "Londres", "Italia"],
    data = [10,20,40]
)
a+b

Dublin      NaN
Italia      NaN
Londres    40.0
Taubaté    20.0
dtype: float64

## DataFrame

In [5]:
df = pd.DataFrame(
    data = np.random.randn(2,3),
    index = ['A','B'],
    columns = ['x','y','z']
)
df

          x         y         z
A -0.021812  2.171688  1.204350
B -0.003501 -0.449356  0.779307

In [6]:
df['x']

A   -0.021812
B   -0.003501
Name: x, dtype: float64

In [7]:
df.x #IDEM

A   -0.021812
B   -0.003501
Name: x, dtype: float64

In [8]:
df['y']

A    2.171688
B   -0.449356
Name: y, dtype: float64

In [9]:
df[['x','y']]

          x         y
A -0.021812  2.171688
B -0.003501 -0.449356

In [10]:
# creating new Rows
df['new'] = df['x'] + df['y']*2
df

          x         y         z       new
A -0.021812  2.171688  1.204350  4.321563
B -0.003501 -0.449356  0.779307 -0.902213

In [11]:
df['new2'] = 100
df

          x         y         z       new  new2
A -0.021812  2.171688  1.204350  4.321563   100
B -0.003501 -0.449356  0.779307 -0.902213   100

In [12]:
# Remove Rows
df.drop('new',axis=1,inplace=True)
df.drop('new2',axis=1,inplace=True)

In [13]:
df

          x         y         z
A -0.021812  2.171688  1.204350
B -0.003501 -0.449356  0.779307

In [14]:
# Remove Columns
df.drop('B',axis=0,inplace=True)

In [15]:
df

          x         y        z
A -0.021812  2.171688  1.20435

In [16]:
df.loc[['A'],['x','y']]

          x         y
A -0.021812  2.171688

### Deleting NaN

In [17]:
dados = {
    'a':[10,2,20,4,5,None,None,10],
    'b':[1,2,30,4,5,6,0,8],
    'c':[1,2,3,15,5,6,7,8]
}

x = pd.DataFrame(dados)
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
a    6 non-null float64
b    8 non-null int64
c    8 non-null int64
dtypes: float64(1), int64(2)
memory usage: 272.0 bytes

In [18]:
x.head()

      a   b   c
0  10.0   1   1
1   2.0   2   2
2  20.0  30   3
3   4.0   4  15
4   5.0   5   5

In [19]:
# DELETING NaN
y = x.dropna()
y

      a   b   c
0  10.0   1   1
1   2.0   2   2
2  20.0  30   3
3   4.0   4  15
4   5.0   5   5
7  10.0   8   8

In [20]:
# DELETING NaN + RESET the INDEX
y = x.dropna().reset_index()
y

   index     a   b   c
0      0  10.0   1   1
1      1   2.0   2   2
2      2  20.0  30   3
3      3   4.0   4  15
4      4   5.0   5   5
5      7  10.0   8   8

In [21]:
# DELETING NaN + RESET the INDEX + DEL ROW 'Index'
y = x.dropna().reset_index().drop('index',axis=1)
y

      a   b   c
0  10.0   1   1
1   2.0   2   2
2  20.0  30   3
3   4.0   4  15
4   5.0   5   5
5  10.0   8   8

### Condiction - add value

In [22]:
k = y[y > 5]
k

      a     b     c
0  10.0   NaN   NaN
1   NaN   NaN   NaN
2  20.0  30.0   NaN
3   NaN   NaN  15.0
4   NaN   NaN   NaN
5  10.0   8.0   8.0

In [23]:
k = k.dropna()
k

      a    b    c
5  10.0  8.0  8.0

In [24]:
# Condiction - Add value - Select row
g = y[ y['a'] > 5 ]
g

      a   b  c
0  10.0   1  1
2  20.0  30  3
5  10.0   8  8

In [25]:
h = y[ y[['a','b']] > 5 ]
h

      a     b   c
0  10.0   NaN NaN
1   NaN   NaN NaN
2  20.0  30.0 NaN
3   NaN   NaN NaN
4   NaN   NaN NaN
5  10.0   8.0 NaN

In [26]:
# Deleting any line
x.drop(2,axis=0)

      a  b   c
0  10.0  1   1
1   2.0  2   2
3   4.0  4  15
4   5.0  5   5
5   NaN  6   6
6   NaN  0   7
7  10.0  8   8

In [27]:
x.drop(7,axis=0)

      a   b   c
0  10.0   1   1
1   2.0   2   2
2  20.0  30   3
3   4.0   4  15
4   5.0   5   5
5   NaN   6   6
6   NaN   0   7

# Ascending and Descending Order

In [28]:
y = x.sort_values('a',ascending=True)
y

      a   b   c
1   2.0   2   2
3   4.0   4  15
4   5.0   5   5
0  10.0   1   1
7  10.0   8   8
2  20.0  30   3
5   NaN   6   6
6   NaN   0   7

In [29]:
# Resetar os ìndices
y = y.reset_index().drop('index',axis=1)
y

      a   b   c
0   2.0   2   2
1   4.0   4  15
2   5.0   5   5
3  10.0   1   1
4  10.0   8   8
5  20.0  30   3
6   NaN   6   6
7   NaN   0   7

In [30]:
# Descending
y = x.sort_values('a',ascending=False)
y

      a   b   c
2  20.0  30   3
0  10.0   1   1
7  10.0   8   8
4   5.0   5   5
3   4.0   4  15
1   2.0   2   2
5   NaN   6   6
6   NaN   0   7

### Missing Data

In [31]:
d = {'A':[1,2,None],'B':[5,np.nan,np.nan],'C':[1,2,3]}

df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [32]:
# Dropdown the rows that dont have value

In [33]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [34]:
# Cut down the columns without value
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [35]:
### Replace NaN for other thing
df.fillna(value = 'NOTHING')

         A        B  C
0        1        5  1
1        2  NOTHING  2
2  NOTHING  NOTHING  3

In [36]:
### Replace NaN by an mean
df.fillna(value = df['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

### GROUPBY

In [37]:
data = {
    'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
    'Person':['Sam','Charlie',"Amy",'Vanessa','Carl','Sarah'],
    'Sales':[200,120,340,124,243,350]
}

In [38]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [39]:
byComp = df.groupby('Company')
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [40]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [41]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [42]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [43]:
byComp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [44]:
byComp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [45]:
byComp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

### Transpose

In [46]:
byComp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [47]:
byComp.describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [48]:
byComp['Sales'].max()

Company
FB      350
GOOG    200
MSFT    340
Name: Sales, dtype: int64

# Pandas - Parte 2 - MIGUEL

### Open documents

In [49]:
# x = pd.read_... ('./xxx', sep='...')

### Create your Table

In [50]:
x = pd.DataFrame(
    data = {
        'a':[1,2,3],
        'b':[4,5,6]
    }
)
x

   a  b
0  1  4
1  2  5
2  3  6

In [51]:
df = pd.DataFrame(
    index=[0,1,2],
    columns=['a','b'],
    data=[[1,2],[3,4],[5,6]]
)
df

   a  b
0  1  2
1  3  4
2  5  6

### Creating a new rows

In [52]:
df['c'] = df['a']*10
df

   a  b   c
0  1  2  10
1  3  4  30
2  5  6  50

### Operations

In [53]:
# Unique - Get only value without repeated of 
# 1 row
df['a'].unique()

array([1, 3, 5])

In [54]:
df[ df['a'] > 2 ]

   a  b   c
1  3  4  30
2  5  6  50

In [55]:
df['a'] > 2

0    False
1     True
2     True
Name: a, dtype: bool

In [56]:
df[ (df['a'] == 1) & (df['b'] == 2)]

   a  b   c
0  1  2  10

### Apply( )

In [57]:
df

   a  b   c
0  1  2  10
1  3  4  30
2  5  6  50

In [58]:
def soma(x):

    return x+1

In [59]:
df.apply(soma)

   a  b   c
0  2  3  11
1  4  5  31
2  6  7  51

<p style='color:red;'> If and Else inside the function not working if you dont select a Rows!!!</p> 

 <h4>Use ... applymap()</h4>

In [60]:
def new(x):
    if x < 3:
        return 100
    return x+1

In [61]:
df.applymap(new)

     a    b   c
0  100  100  11
1    4    5  31
2    6    7  51

In [82]:
# Other way to put if else..
def f(x):
    a = x[0] # you need to separate "a"
    b = x[1] # you need to separate "b"
    if a == 1 and b == 2:
        return 100
    return a

In [83]:
df['a'] = df[['a','b']].apply(f,axis=1)

In [108]:
df

     a  b   c
0  100  2  10
1    3  4  30
2    5  6  50

### Get_Dumies () 

Transform STRING in Nº

In [94]:
#Exemple
df1 = pd.DataFrame(
    data = {"color":['green','red','blue']}
)
df1

   color
0  green
1    red
2   blue

In [105]:
pd.get_dummies(df1['color'])

   blue  green  red
0     0      1    0
1     0      0    1
2     1      0    0

### get one class and sum all

In [120]:
df.groupby('a').first()

     b   c
a
3    4  30
5    6  50
100  2  10

### Select some values

In [135]:
#Colunas que quero
col = df.columns[1:]
coluna = df[col]
coluna

   b   c
0  2  10
1  4  30
2  6  50

### Transpose

In [137]:
new = df.transpose()
new

     0   1   2
a  100   3   5
b    2   4   6
c   10  30  50

In [142]:
new = new.rename(
    columns={
        0:'vira_0',
        1:'vira_1',
        2:'vira_2'
    }
)

In [143]:
new

   vira_0  vira_1  vira_2
a     100       3       5
b       2       4       6
c      10      30      50

### iloc x loc

In [145]:
a = pd.DataFrame(
    data = {
        'R$':[100,200],
        'Dívida':[0,100]
    },
    index = ['Miguel','Priscila']
)
a

           R$  Dívida
Miguel    100       0
Priscila  200     100

In [151]:
a.iloc[0] # numeric index

R$        100
Dívida      0
Name: Miguel, dtype: int64

In [148]:
a.loc['Miguel'] # name index

R$        100
Dívida      0
Name: Miguel, dtype: int64